tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendMeteringTrialButton(const char* label,
                             const MeteringParameters& params,
                             std::uint32_t defaultMl,
                             std::uint32_t defaultSec,
                             const char* className = "btn-link") {
    (void)defaultMl;
    (void)defaultSec;
    sendFmt("<button class='%s' type='button' data-metering-trial='1' data-trial-label='",
            className ? className : "btn-link");
    sendHtmlAttrEscaped(label ? label : "计量方案");
    sendFmt("' data-startup-pulses='%lu' data-startup-volume='%lu' data-stable-ppl='%lu' "
            "data-startup-duration-ms='%lu' data-stable-flow-ml-min='%lu' "
            "data-default-ml='1000' data-default-sec='60' onclick='faucetOpenMeteringTrial(this)'>测算</button>",
            static_cast<unsigned long>(params.startupPulseCount),
            static_cast<unsigned long>(params.startupVolumeMl),
            static_cast<unsigned long>(params.stablePulsePerLiter),
            static_cast<unsigned long>(params.startupDurationMs),
            static_cast<unsigned long>(params.stableFlowMlPerMin));
}

void formatSchemeTimestamp(std::uint32_t seconds, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (seconds == 0) {
        std::snprintf(out, len, "-");
        return;
    }
    if (seconds >= kMinRealDateSeconds) {
        formatRecordTime(seconds, out, len);
        return;
    }
    std::snprintf(out, len, "开机+%lu s", static_cast<unsigned long>(seconds));
}

void sendSchemeDetailAttr(const char* name, const char* value) {
    sendFmt(" data-detail-%s='", name);
    sendHtmlAttrEscaped(value ? value : "-");
    Esp32BaseWeb::sendChunk("'");
}

void sendSchemeDetailButton(const MeteringSchemeRecord& scheme, std::uint32_t activeId) {
    char startupVolume[24]{};
    char stableFlow[24]{};
    char minActual[24]{};
    char maxActual[24]{};
    char maxError[24]{};
    char actualRange[56]{};
    char startupDuration[24]{};
    char createdAt[40]{};
    char updatedAt[40]{};
    char status[64]{};
    formatLiters(scheme.params.startupVolumeMl, startupVolume, sizeof(startupVolume));
    formatFlowLitersPerMin(scheme.params.stableFlowMlPerMin, stableFlow, sizeof(stableFlow));
    formatStartupDurationSeconds(scheme.params.startupDurationMs, startupDuration, sizeof(startupDuration));
    formatLiters(scheme.minActualMl, minActual, sizeof(minActual));
    formatLiters(scheme.maxActualMl, maxActual, sizeof(maxActual));
    formatLiters(scheme.maxErrorMl, maxError, sizeof(maxError));
    if (scheme.minActualMl > 0 || scheme.maxActualMl > 0) {
        std::snprintf(actualRange, sizeof(actualRange), "%s - %s", minActual, maxActual);
    } else {
        std::snprintf(actualRange, sizeof(actualRange), "-");
    }
    formatSchemeTimestamp(scheme.createdAt, createdAt, sizeof(createdAt));
    formatSchemeTimestamp(scheme.updatedAt, updatedAt, sizeof(updatedAt));
    std::snprintf(status,
                  sizeof(status),
                  "%s / 历史使用：%s",
                  scheme.id == activeId ? "当前启用" :
                  (scheme.state == MeteringSchemeState::Available ? "可用" : "已停用"),
                  scheme.usedEver ? "有记录" : "无记录");

    Esp32BaseWeb::sendChunk("<button class='btn-link' type='button' data-scheme-detail='1'");
    sendFmt(" data-detail-id='%lu' data-detail-revision='%lu' data-detail-startup-pulses='%luP' "
            "data-detail-stable-ppl='%luP/L' data-detail-startup-duration='%s' "
            "data-detail-sample-count='%u 条' data-detail-use-count='%s'",
            static_cast<unsigned long>(scheme.id),
            static_cast<unsigned long>(scheme.revision),
            static_cast<unsigned long>(scheme.params.startupPulseCount),
            static_cast<unsigned long>(scheme.params.stablePulsePerLiter),
            startupDuration,
            static_cast<unsigned>(scheme.sampleCount),
            scheme.usedEver ? "有出水记录引用" : "无出水记录引用");
    sendSchemeDetailAttr("name", scheme.name);
    sendSchemeDetailAttr("status", status);
    sendSchemeDetailAttr("source", meteringSchemeSourceName(scheme.sourceType));
    sendSchemeDetailAttr("created-at", createdAt);
    sendSchemeDetailAttr("updated-at", updatedAt);
    sendSchemeDetailAttr("startup-volume", startupVolume);
    sendSchemeDetailAttr("stable-flow", stableFlow);
    sendSchemeDetailAttr("actual-range", actualRange);
    sendFmt(" data-detail-max-error='");
    sendHtmlAttrEscaped(maxError);
    sendFmt(" / %u.%u%%'",
            static_cast<unsigned>(scheme.maxErrorTenthPercent / 10U),
            static_cast<unsigned>(scheme.maxErrorTenthPercent % 10U));
    Esp32BaseWeb::sendChunk(" onclick='faucetOpenSchemeDetail(this)'>详情</button>");
}

void sendSchemeDetailModal() {
    Esp32BaseWeb::sendChunk("<div id='scheme-detail-modal' class='scheme-detail-modal' aria-hidden='true'>"
                            "<div class='scheme-detail-card'><div class='panel-head'><h3>方案详情</h3>"
                            "<button class='btn-link' type='button' onclick='faucetCloseSchemeDetail()'>关闭</button></div>"
                            "<table class='kv scheme-detail-kv'>"
                            "<tr><th>ID</th><td data-scheme-detail-field='id'>-</td></tr>"
                            "<tr><th>名称</th><td data-scheme-detail-field='name'>-</td></tr>"
                            "<tr><th>状态</th><td data-scheme-detail-field='status'>-</td></tr>"
                            "<tr><th>revision</th><td data-scheme-detail-field='revision'>-</td></tr>"
                            "<tr><th>来源</th><td data-scheme-detail-field='source'>-</td></tr>"
                            "<tr><th>创建时间</th><td data-scheme-detail-field='createdAt'>-</td></tr>"
                            "<tr><th>修改时间</th><td data-scheme-detail-field='updatedAt'>-</td></tr>"
                            "<tr><th>容量估算参数</th><td><span data-scheme-detail-field='startupPulses'>-</span> / <span data-scheme-detail-field='startupVolume'>-</span> / <span data-scheme-detail-field='stablePpl'>-</span></td></tr>"
                            "<tr><th>时间估算参数</th><td><span data-scheme-detail-field='startupDuration'>-</span> / <span data-scheme-detail-field='stableFlow'>-</span></td></tr>"
                            "<tr><th>样本数量</th><td data-scheme-detail-field='sampleCount'>-</td></tr>"
                            "<tr><th>容量范围</th><td data-scheme-detail-field='actualRange'>-</td></tr>"
                            "<tr><th>最大误差</th><td data-scheme-detail-field='maxError'>-</td></tr>"
                            "<tr><th>历史使用</th><td data-scheme-detail-field='useCount'>-</td></tr>"
                            "</table></div></div>");
}

void sendMeteringMetricCard(const char* label, const char* value) {
    Esp32BaseWeb::sendChunk("<div class='metering-metric'><span>");
    Esp32BaseWeb::sendChunk(label ? label : "");
    Esp32BaseWeb::sendChunk("</span><strong>");
    Esp32BaseWeb::sendChunk(value ? value : "-");
    Esp32BaseWeb::sendChunk("</strong></div>");
}

void sendActiveMeteringSchemeCard(const MeteringSchemeRecord& scheme, std::uint32_t activeId) {
    char startupPulses[24]{};
    char startupVolume[24]{};
    char stablePpl[24]{};
    char startupDuration[24]{};
    char stableFlow[24]{};
    char samples[24]{};
    char actualRange[56]{};
    char maxError[32]{};
    char meta[120]{};
    char minActual[24]{};
    char maxActual[24]{};
    char maxErrorMl[24]{};
    formatLiters(scheme.params.startupVolumeMl, startupVolume, sizeof(startupVolume));
    formatFlowLitersPerMin(scheme.params.stableFlowMlPerMin, stableFlow, sizeof(stableFlow));
    formatLiters(scheme.minActualMl, minActual, sizeof(minActual));
    formatLiters(scheme.maxActualMl, maxActual, sizeof(maxActual));
    formatLiters(scheme.maxErrorMl, maxErrorMl, sizeof(maxErrorMl));
    std::snprintf(startupPulses, sizeof(startupPulses), "%luP", static_cast<unsigned long>(scheme.params.startupPulseCount));
    std::snprintf(stablePpl, sizeof(stablePpl), "%luP/L", static_cast<unsigned long>(scheme.params.stablePulsePerLiter));
    formatStartupDurationSeconds(scheme.params.startupDurationMs, startupDuration, sizeof(startupDuration));
    std::snprintf(samples, sizeof(samples), "%u 条", static_cast<unsigned>(scheme.sampleCount));
    if (scheme.minActualMl > 0 || scheme.maxActualMl > 0) {
        std::snprintf(actualRange, sizeof(actualRange), "%s - %s", minActual, maxActual);
    } else {
        std::snprintf(actualRange, sizeof(actualRange), "-");
    }
    std::snprintf(maxError,
                  sizeof(maxError),
                  "%s / %u.%u%%",
                  maxErrorMl,
                  static_cast<unsigned>(scheme.maxErrorTenthPercent / 10U),
                  static_cast<unsigned>(scheme.maxErrorTenthPercent % 10U));
    std::snprintf(meta,
                  sizeof(meta),
                  "#%lu · rev %lu",
                  static_cast<unsigned long>(scheme.id),
                  static_cast<unsigned long>(scheme.revision));

    Esp32BaseWeb::sendChunk("<section class='panel active-metering-card'><div class='panel-head'><div><h3>当前启用方案</h3><p class='active-metering-name'>");
    sendHtmlEscapedBounded(scheme.name, sizeof(scheme.name));
    Esp32BaseWeb::sendChunk("</p><p class='hint'>");
    Esp32BaseWeb::sendChunk(meta);
    Esp32BaseWeb::sendChunk("</p></div>");
    sendFmt("<span class='status-pill %s'>%s</span></div><div class='active-metering-metrics'>",
            scheme.id == activeId ? "status-ok" : "status-warn",
            scheme.id == activeId ? "当前启用" : "当前方案异常");
    sendMeteringMetricCard("启动脉冲", startupPulses);
    sendMeteringMetricCard("启动水量", startupVolume);
    sendMeteringMetricCard("稳态 P/L", stablePpl);
    sendMeteringMetricCard("启动时长", startupDuration);
    sendMeteringMetricCard("稳态流速", stableFlow);
    sendMeteringMetricCard("样本", samples);
    sendMeteringMetricCard("容量范围", actualRange);
    sendMeteringMetricCard("最大误差", maxError);
    Esp32BaseWeb::sendChunk("</div><div class='row-actions active-metering-actions'>");
    sendSchemeDetailButton(scheme, activeId);
    sendMeteringTrialButton(scheme.name[0] ? scheme.name : "当前计量方案", scheme.params, 1000, 10);
    sendFmt("<a class='btn-link' href='/faucet/metering?scheme=%lu'>编辑</a>",
            static_cast<unsigned long>(scheme.id));
    Esp32BaseWeb::sendChunk("</div></section>");
}

void sendActiveMeteringSchemeSummaryPanel() {
    MeteringSchemeRecord active{};
    bool activeReady = false;
    if (g_context.app) {
        active = g_context.app->activeMeteringScheme();
        activeReady = active.recordUsed;
    }
    if (!activeReady && activeMeteringSchemeForWeb(active)) {
        activeReady = true;
    }
    if (activeReady) {
        sendActiveMeteringSchemeCard(active, active.id);
        return;
    }
    Esp32BaseWeb::sendChunk("<section class='panel active-metering-card'><div class='panel-head'><div><h3>当前启用方案</h3>"
                            "<p class='active-metering-name'>-</p><p class='hint'>计量方案尚未就绪。</p></div>"
                            "<span class='status-pill status-muted'>无可用方案</span></div></section>");
}

void sendMeteringSchemeListPlaceholder() {
    Esp32BaseWeb::sendChunk("<section id='metering-scheme-list' class='panel calibration-param-panel'><div class='panel-head'><h3>计量方案列表</h3>"
                            "<button class='btn-link' type='button' onclick='return faucetLoadSchemeListPanel(this)'>打开方案列表</button></div>"
                            "<p class='muted'>方案列表会读取 Flash 中的方案槽位；需要切换、编辑或删除方案时再打开。</p>"
                            "</section>");
}

