tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendMeteringTrialModal() {
    Esp32BaseWeb::sendChunk("<div id='metering-trial-modal' class='metering-trial-modal' aria-hidden='true'>"
                            "<div class='metering-trial-card'><div class='panel-head'><h3>测算</h3>"
                            "<button class='btn-link' type='button' onclick='faucetCloseMeteringTrial()'>关闭</button></div>"
                            "<form class='metering-trial-form' oninput='faucetEstimateMeteringTrial(this)' onchange='faucetEstimateMeteringTrial(this)' onsubmit='return false'>"
                            "<p class='generated-note' data-trial-label>-</p>"
                            "<div class='trial-estimator-grid'><section class='trial-estimator-panel'><h4>容量目标</h4>"
                            "<label class='compact-field'><span>目标水量</span><span class='estimator-input-row'>"
                            "<input name='targetMl' type='number' min='1' max='");
    sendFmt("%lu", static_cast<unsigned long>(kMaxVolumePresetMl));
    Esp32BaseWeb::sendChunk("' step='1' value='1000'><span class='unit-label'>ml</span></span></label>"
                            "<div class='estimate-results'><div><span>预计出水时长</span><strong data-volume-estimated-duration>-</strong></div>"
                            "<div><span>预计脉冲总数</span><strong data-volume-estimated-pulses>-</strong></div></div></section>"
                            "<section class='trial-estimator-panel'><h4>时间目标</h4>"
                            "<label class='compact-field'><span>出水时长</span><span class='estimator-input-row'>"
                            "<input name='targetSec' type='number' min='1' max='1800' step='1' value='60'><span class='unit-label'>秒</span></span></label>"
                            "<div class='estimate-results'><div><span>预计出水量</span><strong data-time-estimated-volume>-</strong></div>"
                            "<div><span>预计脉冲总数</span><strong data-time-estimated-pulses>-</strong></div></div></section></div>"
                            "<p class='generated-note'>测算只按当前按钮提供的计量参数计算，不会远程启动出水。</p>"
                            "</form></div></div>");
}

void sendCalibrationParameterPanels() {
    MeteringSchemeRecord* schemes = new (std::nothrow) MeteringSchemeRecord[kMeteringSchemeStoreSlotCount]{};
    const bool ready = ensureMeteringSchemesReady();
    const std::size_t count =
        ready && schemes ? g_context.meteringSchemes->list(schemes, kMeteringSchemeStoreSlotCount, true) : 0;
    const std::uint32_t activeId = ready ? g_context.meteringSchemes->activeSchemeId() : 0;
    char createdText[24]{};
    std::uint32_t createdSchemeId = 0;
    if (getParam("createdScheme", createdText, sizeof(createdText))) {
        parseU32(createdText, createdSchemeId);
    }

    Esp32BaseWeb::sendChunk("<section id='metering-scheme-list' class='panel calibration-param-panel'><div class='panel-head'><h3>计量方案列表</h3>"
                            "<a class='btn-link' href='/faucet/metering?scheme=new'>新建方案</a></div>"
                            "<table class='calibration-slot-table metering-scheme-table'><tr><th>方案</th><th>状态</th><th>启动阶段</th><th>稳态阶段</th><th>样本与误差</th><th>操作</th></tr>");
    if (!ready) {
        const AppStorageStatus status =
            g_context.meteringSchemes ? g_context.meteringSchemes->status() : AppStorageStatus::Unavailable;
        sendFmt("<tr><td colspan='6'>计量方案存储不可用：%s（%s）。</td></tr>",
                appStorageStatusMessage(status),
                appStorageStatusCode(status));
    } else if (!schemes) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='6'>内存不足，无法加载方案列表。</td></tr>");
    } else if (count == 0) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='6'>还没有计量方案。可以新建手工方案，或从长期样本库生成方案。</td></tr>");
    }
    for (std::size_t i = 0; i < count; ++i) {
        const MeteringSchemeRecord& scheme = schemes[i];
        char startupVolume[24]{};
        char startupDuration[24]{};
        char stableFlow[24]{};
        char minActual[20]{};
        char maxActual[20]{};
        char maxError[20]{};
        formatLiters(scheme.params.startupVolumeMl, startupVolume, sizeof(startupVolume));
        formatStartupDurationSeconds(scheme.params.startupDurationMs, startupDuration, sizeof(startupDuration));
        formatFlowLitersPerMin(scheme.params.stableFlowMlPerMin, stableFlow, sizeof(stableFlow));
        if (scheme.sampleCount > 0) {
            formatLiters(scheme.minActualMl, minActual, sizeof(minActual));
            formatLiters(scheme.maxActualMl, maxActual, sizeof(maxActual));
            formatLiters(scheme.maxErrorMl, maxError, sizeof(maxError));
        }

        sendFmt("<tr class='%s%s'><td><b>#%lu ",
                scheme.id == activeId ? "is-active " : "",
                scheme.id == createdSchemeId ? "scheme-created-row" : "",
                static_cast<unsigned long>(scheme.id));
        sendHtmlEscapedBounded(scheme.name, sizeof(scheme.name));
        sendFmt("</b><small>rev %lu</small></td><td>",
                static_cast<unsigned long>(scheme.revision));
        if (scheme.id == activeId) {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-ok'>当前启用</span>");
            if (scheme.id == createdSchemeId) {
                Esp32BaseWeb::sendChunk(" <span class='status-pill status-warn'>刚保存</span>");
            }
        } else if (scheme.state == MeteringSchemeState::Disabled) {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>已禁用</span>");
            if (scheme.id == createdSchemeId) {
                Esp32BaseWeb::sendChunk(" <span class='status-pill status-warn'>刚保存</span>");
            }
        } else {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>可用</span>");
            if (scheme.id == createdSchemeId) {
                Esp32BaseWeb::sendChunk(" <span class='status-pill status-warn'>刚保存</span>");
            }
        }
        sendFmt("</td><td><div class='scheme-param-lines'><span>启动脉冲：%luP</span><span>启动水量：%s</span><span>启动时长：%s</span></div></td>"
                "<td><div class='scheme-param-lines'><span>容量计量：%luP/L</span><span>时间估算：%s</span></div></td>"
                "<td><div class='scheme-param-lines'>",
                static_cast<unsigned long>(scheme.params.startupPulseCount),
                startupVolume,
                startupDuration,
                static_cast<unsigned long>(scheme.params.stablePulsePerLiter),
                stableFlow);
        if (scheme.sampleCount > 0) {
            sendFmt("<span>样本：%u 条</span><span>历史使用：%s</span><span>容量范围：%s - %s</span><span>最大误差：%s / %u.%u%%</span>",
                    static_cast<unsigned>(scheme.sampleCount),
                    scheme.usedEver ? "有记录" : "无记录",
                    minActual,
                    maxActual,
                    maxError,
                    static_cast<unsigned>(scheme.maxErrorTenthPercent / 10U),
                    static_cast<unsigned>(scheme.maxErrorTenthPercent % 10U));
        } else {
            sendFmt("<span>样本：无样本摘要</span><span>历史使用：%s</span><span>最大误差：-</span>",
                    scheme.usedEver ? "有记录" : "无记录");
        }
        Esp32BaseWeb::sendChunk("</div></td><td><div class='row-actions scheme-row-actions'>");
        sendSchemeDetailButton(scheme, activeId);
        sendMeteringTrialButton(scheme.name[0] ? scheme.name : "计量方案", scheme.params, 1000, 10);
        sendFmt("<a class='btn-link' href='/faucet/metering?scheme=%lu'>编辑</a>",
                static_cast<unsigned long>(scheme.id));
        if (scheme.id != activeId) {
            sendFmt("<form method='post' action='/faucet/metering' onsubmit=\"return confirm('确认切换当前计量方案？')&&once(this)\"><input type='hidden' name='action' value='enable_metering_scheme'><input type='hidden' name='id' value='%lu'><input class='primary' type='submit' value='%s'></form>",
                    static_cast<unsigned long>(scheme.id),
                    scheme.id == createdSchemeId ? "切换使用此方案" : "切换使用");
        }
        if (canPhysicallyDeleteMeteringScheme(scheme, activeId, count)) {
            sendFmt("<form method='post' action='/faucet/metering' onsubmit=\"return confirm('确认删除未使用的计量方案？')&&once(this)\"><input type='hidden' name='action' value='delete_metering_scheme'><input type='hidden' name='id' value='%lu'><input class='danger' type='submit' value='删除'></form>",
                    static_cast<unsigned long>(scheme.id));
        }
        Esp32BaseWeb::sendChunk("</div></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table>");
    if (ready && count == kMeteringSchemeStoreSlotCount) {
        Esp32BaseWeb::sendChunk("<p class='muted'>方案槽位已满；新方案会按覆盖策略复用最早的非当前槽位。</p>");
    }
    sendSchemeDetailModal();
    Esp32BaseWeb::sendChunk("</section>");
    delete[] schemes;
}

void sendMeteringSchemeEditPage(bool creating, const MeteringSchemeRecord* scheme) {
    const char* title = creating ? "新建计量方案" : "修改计量方案";
    Esp32BaseWeb::sendHeader(title);
    sendFmt("<h2>%s</h2><p><a class='btn-link' href='/faucet/metering'>返回计量方案</a></p>", title);
    sendNoticeFromQuery();
    const MeteringParameters params = scheme ? scheme->params : MeteringParameters{};
    const bool editingActive = !creating && scheme && ensureMeteringSchemesReady() &&
                               scheme->id == g_context.meteringSchemes->activeSchemeId();
    Esp32BaseWeb::sendChunk("<section class='panel calibration-param-panel scheme-edit-panel'><form class='scheme-edit-form' method='post' action='/faucet/metering' onsubmit='return once(this)'>");
    Esp32BaseWeb::sendChunk(creating ? "<input type='hidden' name='action' value='create_metering_scheme'>"
                                     : "<input type='hidden' name='action' value='edit_metering_scheme'>");
    if (!creating && scheme) {
        sendFmt("<input type='hidden' name='id' value='%lu'>", static_cast<unsigned long>(scheme->id));
    }
    if (editingActive) {
        Esp32BaseWeb::sendChunk("<p class='warn scheme-edit-warning'>当前启用方案：保存后会立即影响后续出水估算。</p>");
    }
    Esp32BaseWeb::sendChunk("<div class='scheme-edit-section'><h3>方案信息</h3><div class='scheme-edit-grid'>");
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-12'><span>名称</span><input name='name' maxlength='%u' required value='",
            static_cast<unsigned>(kMeteringSchemeNameLength - 1));
    if (scheme && scheme->name[0]) {
        sendHtmlAttrEscapedBounded(scheme->name, sizeof(scheme->name));
    }
    Esp32BaseWeb::sendChunk("'></label>");
    if (!creating && scheme) {
        sendFmt("<div class='scheme-edit-meta scheme-span-12'><span>#%lu</span><span>rev %lu</span><span>%s</span></div>",
                static_cast<unsigned long>(scheme->id),
                static_cast<unsigned long>(scheme->revision),
                scheme->state == MeteringSchemeState::Available ? "可用" : "已禁用");
    }
    Esp32BaseWeb::sendChunk("</div></div><div class='scheme-edit-section'><h3>容量估算计量参数</h3><div class='scheme-edit-grid'>");
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>启动脉冲数</span><input name='startupPulseCount' type='number' min='0' max='%lu' step='1' required%s",
            static_cast<unsigned long>(kMaxSegmentedStartupPulseCount),
            creating ? "" : " value='");
    if (!creating) {
        sendFmt("%lu'", static_cast<unsigned long>(params.startupPulseCount));
    }
    sendFmt("><small class='hint'>单位 P，范围 0-%lu</small></label>",
            static_cast<unsigned long>(kMaxSegmentedStartupPulseCount));
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>启动水量</span><input name='startupVolumeMl' type='number' min='0' max='%lu' step='1' required%s",
            static_cast<unsigned long>(kMaxSegmentedStartupVolumeMl),
            creating ? "" : " value='");
    if (!creating) {
        sendFmt("%lu'", static_cast<unsigned long>(params.startupVolumeMl));
    }
    sendFmt("><small class='hint'>单位 ml，范围 0-%lu</small></label>",
            static_cast<unsigned long>(kMaxSegmentedStartupVolumeMl));
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>稳态 P/L</span><input name='stablePulsePerLiter' type='number' min='%lu' max='%lu' step='1' required%s",
            static_cast<unsigned long>(kMinSegmentedPulsePerLiter),
            static_cast<unsigned long>(kMaxSegmentedPulsePerLiter),
            creating ? "" : " value='");
    if (!creating) {
        sendFmt("%lu'", static_cast<unsigned long>(params.stablePulsePerLiter));
    }
    sendFmt("><small class='hint'>单位 P/L，范围 %lu-%lu</small></label>",
            static_cast<unsigned long>(kMinSegmentedPulsePerLiter),
            static_cast<unsigned long>(kMaxSegmentedPulsePerLiter));
    Esp32BaseWeb::sendChunk("</div></div><div class='scheme-edit-section'><h3>时间估算计量参数</h3><p class='muted'>仅用于预计时间和预计流速展示，不参与实际容量、滤芯累计或统计累计。</p><div class='scheme-edit-grid'>");
    char startupDurationSec[24]{};
    formatStartupDurationSecondsInput(params.startupDurationMs, startupDurationSec, sizeof(startupDurationSec));
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>启动时长</span><input name='startupDurationSec' type='number' min='0' max='%lu' step='0.001' required%s",
            static_cast<unsigned long>(kMaxSegmentedStartupDurationMs / 1000U),
            creating ? "" : " value='");
    if (!creating) {
        sendFmt("%s'", startupDurationSec);
    }
    sendFmt("><small class='hint'>单位 秒，范围 0-%lu，可精确到 0.001 秒</small></label>",
            static_cast<unsigned long>(kMaxSegmentedStartupDurationMs / 1000U));
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>预计稳态流速</span><input name='stableFlowMlPerMin' type='number' min='%lu' max='%lu' step='1' required%s",
            static_cast<unsigned long>(kMinStableFlowMlPerMin),
            static_cast<unsigned long>(kMaxStableFlowMlPerMin),
            creating ? "" : " value='");
    if (!creating) {
        sendFmt("%lu'", static_cast<unsigned long>(params.stableFlowMlPerMin));
    }
    sendFmt("><small class='hint'>单位 ml/min，范围 %lu-%lu</small></label>",
            static_cast<unsigned long>(kMinStableFlowMlPerMin),
            static_cast<unsigned long>(kMaxStableFlowMlPerMin));
    Esp32BaseWeb::sendChunk("</div></div>");
    Esp32BaseWeb::sendChunk(creating ? "<div class='form-actions scheme-edit-actions'><input class='primary' type='submit' value='保存为新方案'>"
                                     : "<div class='form-actions scheme-edit-actions'><input class='primary' type='submit' value='保存修改'>");
    Esp32BaseWeb::sendChunk("<a class='btn-link' href='/faucet/metering'>取消</a></div></form></section>");
    sendPageEnd();
}


void sendCalibrationFormulaPanel() {
    Esp32BaseWeb::sendChunk("<details class='panel calibration-help-panel'><summary><span>查看计量说明</span><small>生成规则、估算公式和测算边界</small></summary>"
                            "<div class='calibration-help-content'><section class='calibration-formula-block'><h3>生成参数：样本与拟合</h3>"
                            "<table class='kv'>"
                            "<tr><th>有效样本条件</th><td>已存入长期样本库、有脉冲明细、有实测容量、原始边沿未因超过单条上限而被截断、未发生暂停后恢复出水且稳态识别成功的样本，才参与生成计量参数。</td></tr>"
                            "<tr><th>稳态识别</th><td>每条样本先从脉冲分布中识别稳态起点，得到启动脉冲数 Ns 样本值和稳态脉冲数。</td></tr>"
                            "<tr><th>生成拟合</th><td><code>实测容量 = Vs + 稳态脉冲数 × 每脉冲毫升数</code>，多条样本拟合得到启动水量 Vs 和稳态P/L。</td></tr>"
                            "<tr><th>生成参数</th><td><code>Ns = 平均启动脉冲数</code>；<code>Vs = 拟合得到的启动水量</code>；<code>Ps = round(1000 / 每脉冲毫升数)</code>。</td></tr>"
                            "<tr><th>生成结果</th><td>点击生成参数后只得到待保存结果；保存为新方案前不会改变当前计量。</td></tr>"
                            "</table></section>"
                            "<section class='calibration-formula-block'><h3>出水估算：计量方案如何使用</h3>"
                            "<table class='kv'>"
                            "<tr><th>容量估算字段</th><td>容量目标和脉冲折算使用启动脉冲数 Ns、启动水量 Vs、稳态P/L Ps。</td></tr>"
                            "<tr><th>P = 0</th><td><code>估算出水量 = 0</code>。</td></tr>"
                            "<tr><th>0 &lt; P &lt;= Ns</th><td><code>估算出水量 = round(P × Vs / Ns)</code>。</td></tr>"
                            "<tr><th>P &gt; Ns</th><td><code>估算出水量 = Vs + round((P - Ns) × 1000 / Ps)</code>。</td></tr>"
                            "<tr><th>时间估算字段</th><td>时间目标模式使用启动时长和预计稳态流速测算出水量；得到预计出水量后，再用容量估算参数折算预计脉冲数。</td></tr>"
                            "<tr><th>测算入口</th><td>样本、生成结果和每套计量方案的“测算”只在浏览器本地核对容量目标或时间目标，不会远程启动出水。</td></tr>"
                            "<tr><th>启用方案</th><td>启用只切换当前计量参数；历史出水记录只保留当时使用的方案 ID，方案仍在时可查看参数，已覆盖时提示不可查看。</td></tr>"
                            "</table></section></div></details>");
}

