tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
const char* segmentedRejectReasonText(SegmentedCalibrationRejectReason reason) {
    switch (reason) {
        case SegmentedCalibrationRejectReason::None:
            return "";
        case SegmentedCalibrationRejectReason::NotEnoughSamples:
            return "可生成样本不足";
        case SegmentedCalibrationRejectReason::VolumeSpanTooSmall:
            return "容量跨度不足";
        case SegmentedCalibrationRejectReason::DegenerateFit:
            return "样本分布无法拟合";
        case SegmentedCalibrationRejectReason::InvalidFit:
            return "拟合结果无效";
        case SegmentedCalibrationRejectReason::ErrorTooHigh:
            return "拟合误差超限";
    }
    return "无法生成";
}

struct CalibrationSampleState {
    std::uint32_t actualMl = 0;
    std::uint32_t stableStartSec = 0;
    bool stable = false;
    bool qualityValid = false;
    bool truncated = false;
    bool resumedAfterPause = false;
};

CalibrationSampleState inspectCalibrationSample(const WaterPulseTrace& trace, bool savedSource) {
    CalibrationSampleState state{};
    state.actualMl = actualMlForSegmentedSample(trace);
    state.truncated = trace.truncated;
    state.resumedAfterPause = trace.resumedAfterPause;
    if (trace.truncated) {
        return state;
    }
    if (trace.sampleCount < 6 || trace.totalPulses == 0) {
        return state;
    }
    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace.sampleCount]{};
    if (!samples) {
        return state;
    }
    const bool copied = savedSource ? copySavedTraceSamples(trace, samples, trace.sampleCount)
                                    : copyRamTraceSamples(trace, samples, trace.sampleCount);
    if (copied) {
        const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(trace, samples, trace.sampleCount);
        state.stable = analysis.stable && analysis.stablePulseCount > 0;
        state.stableStartSec = analysis.stableStartSec;
        state.qualityValid = state.actualMl > 0 && state.stable;
    }
    delete[] samples;
    return state;
}

void sendCalibrationSampleStatusPills(const CalibrationSampleState& state, bool savedSource, const char* containerClass) {
    sendFmt("<span class='%s'>", containerClass);
    if (state.truncated) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-warn'>明细已截断</span>"
                                "<span class='status-pill status-muted'>不入库</span>");
        Esp32BaseWeb::sendChunk("</span>");
        return;
    }
    if (state.actualMl == 0) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>待校准容量</span>");
        if (state.resumedAfterPause) {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-warn'>暂停后恢复</span>");
        }
        Esp32BaseWeb::sendChunk("</span>");
        return;
    }
    Esp32BaseWeb::sendChunk("<span class='status-pill status-ok'>容量已校准</span>");
    if (state.resumedAfterPause) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-warn'>暂停后恢复</span>");
        Esp32BaseWeb::sendChunk("</span>");
        return;
    }
    if (!state.stable) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-warn'>稳态失败</span>");
        Esp32BaseWeb::sendChunk("</span>");
        return;
    }
    Esp32BaseWeb::sendChunk(savedSource ? "<span class='status-pill status-muted'>设备明细</span>"
                                        : "<span class='status-pill status-muted'>RAM 明细</span>");
    Esp32BaseWeb::sendChunk("</span>");
}

bool generationResultRequested() {
    char text[32]{};
    if (getParam("generated", text, sizeof(text)) && std::strcmp(text, "1") == 0) {
        return true;
    }
    return getParam("saved", text, sizeof(text)) && std::strcmp(text, "generated") == 0;
}

bool calibrationContextRequested() {
    char text[24]{};
    return (getParam("from", text, sizeof(text)) && std::strcmp(text, "calibration") == 0) ||
           (getParam("returnTo", text, sizeof(text)) && std::strcmp(text, "calibration") == 0);
}

std::uint32_t configuredPulseObservationWindowSec() {
    const std::uint32_t seconds =
        g_context.config ? g_context.config->pulseObservationWindowSec : kDefaultPulseObservationWindowSec;
    return std::min<std::uint32_t>(std::max<std::uint32_t>(seconds, kMinPulseObservationWindowSec),
                                   kMaxPulseObservationWindowSec);
}

void sendTraceDetailLink(bool fromCalibration,
                         bool savedSource,
                         std::uint32_t traceId,
                         std::uint32_t bucket,
                         const char* label,
                         const char* className = "btn-link") {
    const char* detailPath = fromCalibration ? "/faucet/calibration/detail" : "/faucet/records/detail";
    sendFmt("<a class='%s' href='%s?%s%strace=%lu&bucket=%lu'>%s</a>",
            className,
            detailPath,
            fromCalibration ? "from=calibration&" : "",
            savedSource ? "saved=1&" : "",
            static_cast<unsigned long>(traceId),
            static_cast<unsigned long>(bucket),
            label);
}

bool readCalibrationTraceFromRequest(WaterPulseTrace& trace, bool& savedSource, std::uint32_t& traceId) {
    char text[32]{};
    trace = {};
    traceId = 0;
    savedSource = false;
    if (!getParam("trace", text, sizeof(text)) || !parseU32(text, traceId) || traceId == 0) {
        return false;
    }
    if (getParam("traceSource", text, sizeof(text))) {
        savedSource = std::strcmp(text, "saved") == 0;
    } else if (getParam("saved", text, sizeof(text))) {
        std::uint32_t savedValue = 0;
        savedSource = parseU32(text, savedValue) && savedValue != 0;
    }

    if (savedSource) {
        if (!ensureSavedPulseTracesReady() || !g_context.savedPulseTraces->findById(traceId, trace)) {
            return false;
        }
    } else {
        const WaterPulseTrace* ramTrace = g_context.pulseTraces ? g_context.pulseTraces->findById(traceId) : nullptr;
        if (!ramTrace) {
            return false;
        }
        trace = *ramTrace;
    }
    return trace.finished && trace.sampleCount > 0 && waterRecordCanCalibrate(trace.record);
}

bool ensureCalibratedTraceSaved(bool savedSource,
                                std::uint32_t traceId,
                                const WaterRecord& record,
                                std::uint32_t actualMl) {
    if (savedSource) {
        if (!ensureSavedPulseTracesReady() || !g_context.savedPulseTraces->setActualMl(traceId, actualMl)) {
            return false;
        }
        if (g_context.pulseTraces) {
            g_context.pulseTraces->setActualMlByRecord(record, actualMl);
        }
        return true;
    }
    if (!g_context.pulseTraces || !g_context.pulseTraces->setActualMl(traceId, actualMl)) {
        return false;
    }
    if (!ensureSavedPulseTracesReady()) {
        return false;
    }
    WaterPulseTrace savedTrace{};
    if (g_context.savedPulseTraces->findByRecord(record, savedTrace)) {
        return g_context.savedPulseTraces->setActualMl(savedTrace.traceId, actualMl);
    }
    std::uint32_t savedTraceId = 0;
    WaterPulseTraceSaveStatus status = WaterPulseTraceSaveStatus::Ok;
    return saveRamTraceToDevice(traceId, &savedTraceId, &status);
}

void sendCalibrationSampleRow(const WaterPulseTrace& trace, bool savedSource, std::uint32_t samplePulseWindowSec) {
    char startTime[40]{};
    char duration[24]{};
    formatWaterRecordListTime(trace.record, startTime, sizeof(startTime));
    formatSecondsValue(trace.record.durationSec, duration, sizeof(duration));
    const CalibrationSampleState state = inspectCalibrationSample(trace, savedSource);
    WaterRecordCalibration calibration{};
    const bool calibrated = findRecordCalibration(trace.record, calibration);
    const std::uint32_t defaultActualMl = state.actualMl > 0 ? state.actualMl : trace.record.volumeMl;
    std::uint32_t firstWindowPulses = 0;
    const bool firstWindowReady = firstSecondsPulseTotal(trace, savedSource, samplePulseWindowSec, firstWindowPulses);
    const char* sourceValue = savedSource ? "saved" : "ram";
    char rowId[32]{};
    std::snprintf(rowId,
                  sizeof(rowId),
                  "calibrate-%s-%lu",
                  sourceValue,
                  static_cast<unsigned long>(trace.traceId));
    Esp32BaseWeb::sendChunk("<tr><td>");
    Esp32BaseWeb::sendChunk(startTime);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::sendChunk(duration);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendTargetValue(trace.record);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendLiters(trace.record.volumeMl);
    Esp32BaseWeb::sendChunk("</td><td>");
    if (state.actualMl > 0) {
        sendLitersMl(state.actualMl);
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    sendFmt("</td><td>%luP / %lu点</td><td>",
            static_cast<unsigned long>(trace.totalPulses),
            static_cast<unsigned long>(trace.sampleCount));
    if (firstWindowReady) {
        sendFmt("%luP", static_cast<unsigned long>(firstWindowPulses));
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    if (state.stable) {
        sendFmt("第 %lus", static_cast<unsigned long>(state.stableStartSec));
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    sendTraceDetailLink(true,
                        savedSource,
                        trace.traceId,
                        1,
                        savedSource ? "已保存到设备" : "RAM 中",
                        savedSource ? "trace-badge trace-source-link status-ok" : "trace-badge trace-source-link status-muted");
    Esp32BaseWeb::sendChunk("</td><td>");
    sendCalibrationSampleStatusPills(state, savedSource, "sample-status-pills");
    Esp32BaseWeb::sendChunk("</td><td><div class='row-actions sample-actions'>");
    MeteringParameters trialParams{};
    const bool trialParamsReady = meteringParamsForRecordTrend(trace.record, trialParams);
    const std::uint32_t trialVolumeMl = state.actualMl > 0 ? state.actualMl : trace.record.volumeMl;
    const std::uint32_t trialDefaultTargetMl =
        trace.record.mode == WaterMode::Volume && trace.record.targetValue > 0 ? trace.record.targetValue : trialVolumeMl;
    if (trialParamsReady) {
        sendMeteringTrialButton(savedSource ? "已保存样本" : "RAM 样本",
                                trialParams,
                                trialDefaultTargetMl,
                                trace.record.durationSec);
    }
    if (!trace.truncated && waterRecordCanCalibrate(trace.record)) {
        sendFmt("<button class='btn-link' type='button' onclick=\"faucetShowSampleCalibration('%s')\">%s</button>",
                rowId,
                calibrated || state.actualMl > 0 ? "重新校准" : "校准容量");
    } else {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>不可入库</span>");
    }
    Esp32BaseWeb::sendChunk("</div></td></tr><tr id='");
    Esp32BaseWeb::sendChunk(rowId);
    Esp32BaseWeb::sendChunk("' class='sample-calibration-edit-row'><td colspan='11'>"
                            "<form class='sample-calibration-form' method='post' action='/faucet/calibration' onsubmit='return faucetSubmitSampleCalibration(this)'>"
                            "<input type='hidden' name='action' value='calibrate'>"
                            "<input type='hidden' name='ajax' value='1'>"
                            "<input type='hidden' name='traceSource' value='");
    Esp32BaseWeb::sendChunk(sourceValue);
    Esp32BaseWeb::sendChunk("'><input type='hidden' name='trace' value='");
    sendFmt("%lu", static_cast<unsigned long>(trace.traceId));
    Esp32BaseWeb::sendChunk("'><div class='sample-calibration-info'><strong>校准容量</strong>"
                            "<span>左侧样本来自本次脉冲明细，请按量杯读数填写右侧实测容量。</span>"
                            "<span>保存后只更新这条明细的实测容量；计量方案生成只使用长期样本库。</span>"
                            "<span>该操作只更新样本和校准记录，不会修改当前计量方案。</span>");
    if (calibrated) {
        char calibratedAt[40]{};
        formatWaterRecordTime(WaterRecord{calibration.calibratedAt,
                                          0,
                                          0,
                                          0,
                                          0,
                                          0,
                                          WaterMode::Volume,
                                          WaterResult::Completed,
                                          0,
                                          0,
                                          0,
                                          {0, 0, 0, 0}},
                              calibratedAt,
                              sizeof(calibratedAt));
        const std::int32_t estimateDiff =
            static_cast<std::int32_t>(trace.record.volumeMl) - static_cast<std::int32_t>(calibration.actualMl);
        Esp32BaseWeb::sendChunk("<span>校准记录：第 ");
        sendFmt("%u 次 / %s / 实测脉冲/升 %luP/L / 估算差 ",
                static_cast<unsigned>(calibration.calibrationCount),
                calibratedAt[0] ? calibratedAt : "未知",
                static_cast<unsigned long>(measuredPulsePerLiter(trace.record, calibration)));
        sendSignedLiters(estimateDiff);
        Esp32BaseWeb::sendChunk("，当前计量方案未修改。</span>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='sample-calibration-inputs'>"
                            "<label class='field sample-volume-field'><span>量杯实测容量</span>"
                            "<span class='sample-volume-input-row sample-volume-control'><input name='actualMl' type='number' min='");
    sendFmt("%lu", static_cast<unsigned long>(kMinVolumePresetMl));
    Esp32BaseWeb::sendChunk("' max='");
    sendFmt("%lu", static_cast<unsigned long>(kMaxVolumePresetMl));
    Esp32BaseWeb::sendChunk("' step='1' value='");
    sendFmt("%lu", static_cast<unsigned long>(defaultActualMl));
    Esp32BaseWeb::sendChunk("'><span class='unit-label'>ml</span></span></label>"
                            "<div class='form-actions'><input type='submit' value='保存校准容量'>"
                            "<button class='btn-link' type='button' onclick=\"faucetHideSampleCalibration('");
    Esp32BaseWeb::sendChunk(rowId);
    Esp32BaseWeb::sendChunk("')\">取消</button></div></div></form></td></tr>");
}

bool findLongTermSampleForAttempt(std::uint32_t sessionId,
                                  std::uint8_t attemptIndex,
                                  std::uint32_t& sampleId);

const char* calibrationAttemptStatusText(CalibrationAttemptStatus status) {
    switch (status) {
        case CalibrationAttemptStatus::PendingActual:
            return "待填写实测";
        case CalibrationAttemptStatus::Valid:
            return "可用于校准";
        case CalibrationAttemptStatus::Skipped:
            return "已放弃";
        case CalibrationAttemptStatus::Invalid:
            return "不可用于校准";
        case CalibrationAttemptStatus::Empty:
            break;
    }
    return "未记录";
}

const char* calibrationInvalidReasonText(CalibrationInvalidReason reason) {
    switch (reason) {
        case CalibrationInvalidReason::ResumedAfterPause:
            return "暂停后恢复";
        case CalibrationInvalidReason::TruncatedTrace:
            return "明细已截断";
        case CalibrationInvalidReason::MissingActualMl:
            return "缺少实测容量";
        case CalibrationInvalidReason::NoEffectivePulse:
            return "无有效脉冲";
        case CalibrationInvalidReason::AnalysisFailed:
            return "稳态识别失败";
        case CalibrationInvalidReason::ErrorResult:
            return "出水结果异常";
        case CalibrationInvalidReason::StorageFailed:
            return "存储失败";
        case CalibrationInvalidReason::None:
            break;
    }
    return "不满足有效样本条件";
}

void sendCalibrationSessionAttemptRow(const CalibrationSessionRecord& session,
                                      const CalibrationAttempt& attempt,
                                      std::uint32_t samplePulseWindowSec) {
    char timeText[40]{};
    char durationText[24]{};
    char targetText[24]{};
    char estimateText[24]{};
    char actualText[24]{};
    formatWaterRecordListTime(attempt.record, timeText, sizeof(timeText));
    formatDurationShort(attempt.record.durationSec, durationText, sizeof(durationText));
    formatLitersMl(attempt.targetHintMl, targetText, sizeof(targetText));
    formatLitersMl(attempt.record.volumeMl, estimateText, sizeof(estimateText));
    if (attempt.actualMl > 0) {
        formatLitersMl(attempt.actualMl, actualText, sizeof(actualText));
    } else {
        std::snprintf(actualText, sizeof(actualText), "-");
    }

