tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void handleRecordInfoPage() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    char text[24]{};
    WaterRecord record{};
    std::uint32_t parsed = 0;
    if (getParam("start", text, sizeof(text)) && parseU32(text, parsed)) {
        record.startTime = parsed;
    }
    if (getParam("volume", text, sizeof(text)) && parseU32(text, parsed)) {
        record.volumeMl = parsed;
    }
    if (getParam("target", text, sizeof(text)) && parseU32(text, parsed)) {
        record.targetValue = parsed;
    }
    if (getParam("pulses", text, sizeof(text)) && parseU32(text, parsed)) {
        record.pulseCount = parsed;
    }
    if (getParam("rejected", text, sizeof(text)) && parseU32(text, parsed)) {
        record.rejectedPulseCount = parsed;
    }
    if (getParam("duration", text, sizeof(text)) && parseU32(text, parsed)) {
        record.durationSec = parsed;
    }
    if (getParam("mode", text, sizeof(text)) && parseU32(text, parsed)) {
        record.mode = parsed == static_cast<std::uint32_t>(WaterMode::Time) ? WaterMode::Time : WaterMode::Volume;
    }
    if (getParam("result", text, sizeof(text)) && parseU32(text, parsed)) {
        record.result = static_cast<WaterResult>(parsed);
    }
    if (getParam("preset", text, sizeof(text)) && parseU32(text, parsed)) {
        record.selectedPreset = static_cast<std::uint8_t>(parsed);
    }
    if (getParam("scheme", text, sizeof(text)) && parseU32(text, parsed)) {
        record.meteringSchemeId = parsed;
    }
    char startTime[40]{};
    formatWaterRecordListTime(record, startTime, sizeof(startTime));
    sendPageStart("接水详情");
    Esp32BaseWeb::sendChunk("<h2>接水详情</h2><div class='form-actions'><a class='btn-link' href='/faucet/records'>返回记录</a></div>"
                            "<section class='panel'><h3>记录信息</h3><table class='kv'>");
    sendFmt("<tr><th>开始时间</th><td>%s</td></tr>", startTime);
    Esp32BaseWeb::sendChunk("<tr><th>模式</th><td>");
    Esp32BaseWeb::sendChunk(modeText(record.mode));
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>目标</th><td>");
    sendTargetValue(record);
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>估算出水</th><td>");
    sendLiters(record.volumeMl);
    sendFmt("</td></tr><tr><th>持续时间</th><td>%lu s</td></tr>"
            "<tr><th>有效脉冲</th><td>%lu P</td></tr>"
            "<tr><th>被过滤脉冲</th><td>%lu P</td></tr>"
            "<tr><th>运行结果</th><td>%s</td></tr>"
            "<tr><th>预设序号</th><td>%u</td></tr>",
            static_cast<unsigned long>(record.durationSec),
            static_cast<unsigned long>(record.pulseCount),
            static_cast<unsigned long>(record.rejectedPulseCount),
            resultText(record.result),
            static_cast<unsigned>(record.selectedPreset));
    MeteringSchemeRecord meteringScheme{};
    if (ensureMeteringSchemesReady() && g_context.meteringSchemes->findById(record.meteringSchemeId, meteringScheme)) {
        char startupDuration[24]{};
        formatStartupDurationSeconds(meteringScheme.params.startupDurationMs, startupDuration, sizeof(startupDuration));
        Esp32BaseWeb::sendChunk("<tr><th>计量方案</th><td>");
        if (meteringScheme.name[0]) {
            sendHtmlEscapedBounded(meteringScheme.name, sizeof(meteringScheme.name));
        } else {
            sendFmt("计量方案 %lu", static_cast<unsigned long>(record.meteringSchemeId));
        }
        sendFmt("<span class='inline-note'>ID #%lu · rev %lu</span></td></tr>"
                "<tr><th>启动脉冲数</th><td>%lu P</td></tr>"
                "<tr><th>启动水量</th><td>%lu ml</td></tr>"
                "<tr><th>稳态 P/L</th><td>%lu P/L</td></tr>"
                "<tr><th>启动时长</th><td>%s</td></tr>"
                "<tr><th>预计稳态流速</th><td>%lu ml/min</td></tr>",
                static_cast<unsigned long>(meteringScheme.id),
                static_cast<unsigned long>(meteringScheme.revision),
                static_cast<unsigned long>(meteringScheme.params.startupPulseCount),
                static_cast<unsigned long>(meteringScheme.params.startupVolumeMl),
                static_cast<unsigned long>(meteringScheme.params.stablePulsePerLiter),
                startupDuration,
                static_cast<unsigned long>(meteringScheme.params.stableFlowMlPerMin));
        if (record.mode == WaterMode::Volume) {
            const MeteringTargetEstimate targetEstimate =
                meteringEstimateForTarget(meteringScheme.params, record.targetValue);
            if (targetEstimate.valid) {
                sendFmt("<tr><th>目标预计总脉冲</th><td>%lu P</td></tr>"
                        "<tr><th>目标全程平均 P/L</th><td>%lu P/L</td></tr>",
                        static_cast<unsigned long>(targetEstimate.pulseCount),
                        static_cast<unsigned long>(targetEstimate.fullRunPulsePerLiter));
            }
        }
    } else if (record.meteringSchemeId != 0) {
        sendFmt("<tr><th>计量方案</th><td>计量方案 ID #%lu 已被覆盖，历史参数不可查看</td></tr>",
                static_cast<unsigned long>(record.meteringSchemeId));
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>计量方案</th><td>记录格式不兼容，历史参数不可查看</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table></section>");
    sendPageEnd();
}

void handleCalibrationPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    if (!requireContext()) {
        return;
    }
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        handleCalibrationPost();
        return;
    }
    if (waterTaskActive()) {
        sendBusyJson("calibration_page");
        return;
    }

    char text[32]{};
    if (getParam("partial", text, sizeof(text))) {
        if (!Esp32BaseWeb::beginResponse(200, "text/html; charset=utf-8", nullptr)) {
            return;
        }
        if (std::strcmp(text, "samples") == 0) {
            sendCalibrationSamplesPanel(configuredPulseObservationWindowSec());
        }
        Esp32BaseWeb::endResponse();
        return;
    }

    const AppSnapshot snapshot = g_context.app->snapshot();
    const bool sessionActive = snapshot.calibrationStatus != CalibrationSessionStatus::Idle &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Applied &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Discarded &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Failed;
    const bool canStartSession = calibrationSessionInactive(snapshot.calibrationStatus);
    const bool canDiscardSession = sessionActive && snapshot.calibrationStatus != CalibrationSessionStatus::Running;
    const bool canEnterActual = snapshot.calibrationStatus == CalibrationSessionStatus::AwaitingActual;
    const bool canGenerate = snapshot.calibrationCanQuickGenerate &&
                             (snapshot.calibrationStatus == CalibrationSessionStatus::ReadyToGenerate ||
                              snapshot.calibrationStatus == CalibrationSessionStatus::AwaitingActual);
    const bool canApply = snapshot.calibrationStatus == CalibrationSessionStatus::Generated;
    const char* stepTitle = "准备校准";
    const char* stepHint = "准备量杯，到设备旁按 OK 继续。";
    switch (snapshot.calibrationStatus) {
        case CalibrationSessionStatus::Idle:
        case CalibrationSessionStatus::Applied:
        case CalibrationSessionStatus::Discarded:
        case CalibrationSessionStatus::Failed:
            stepTitle = "准备校准";
            stepHint = "点击进入校准模式后，到设备旁用本地按键完成出水。";
            break;
        case CalibrationSessionStatus::Preparing:
            stepTitle = "准备量杯";
            stepHint = "确认量杯和水路准备好，到设备旁按 OK。";
            break;
        case CalibrationSessionStatus::WaitingLocalRun:
            stepTitle = "等待本地出水";
            stepHint = "到设备旁按 OK 开始本次校准出水；网页不会启动出水。";
            break;
        case CalibrationSessionStatus::Running:
            stepTitle = "正在校准出水";
            stepHint = "如需停止，请在设备旁按 CANCEL。";
            break;
        case CalibrationSessionStatus::AwaitingActual:
            stepTitle = "填写实测容量";
            stepHint = "按量杯读数填写 ml；保存后才会写入本次样本。";
            break;
        case CalibrationSessionStatus::ReadyToGenerate:
            stepTitle = "可以生成方案";
            stepHint = "2 条可生成，推荐 3 条；可继续补测或生成本次方案。";
            break;
        case CalibrationSessionStatus::Generated:
            stepTitle = "确认应用";
            stepHint = "确认后会创建并启用新计量方案，旧方案保留。";
            break;
    }

    Esp32BaseWeb::sendHeader("校准");
    Esp32BaseWeb::sendChunk("<h2>校准</h2>");
    sendNoticeFromQuery();
    Esp32BaseWeb::sendChunk("<section class='panel calibration-session-panel'><div class='panel-head'><h3>校准会话</h3><div class='calibration-session-badges'>");
    sendFmt("<span class='status-pill %s'>%s</span>",
            sessionActive ? "status-warn" : "status-muted",
            calibrationSessionStatusText(snapshot.calibrationStatus));
    const std::uint32_t nowSeconds = g_context.nowSeconds ? g_context.nowSeconds() : 0;
    if (snapshot.calibrationIdleExpiresAt > 0 && nowSeconds > 0 && snapshot.calibrationIdleExpiresAt > nowSeconds) {
        const std::uint32_t remaining = snapshot.calibrationIdleExpiresAt - nowSeconds;
        sendFmt("<span class='status-pill status-muted calibration-timeout-pill' data-calibration-countdown data-expires-at='%lu' data-remaining='%lu'>剩余 --:--</span>",
                static_cast<unsigned long>(snapshot.calibrationIdleExpiresAt),
                static_cast<unsigned long>(remaining));
    } else if (snapshot.calibrationIdleExpiresAt > 0) {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-muted calibration-timeout-pill'>30 分钟无操作退出</span>");
    }
    Esp32BaseWeb::sendChunk("</div></div>");
    Esp32BaseWeb::sendChunk("<div class='calibration-session-layout'><div class='calibration-step-card'>"
                            "<span class='section-label'>当前步骤</span>");
    sendFmt("<strong>%s</strong><p>%s</p>"
            "<small>网页只负责进入校准、填写容量和确认应用；出水与停水只允许在设备旁通过本地按键操作。非出水中 30 分钟无操作自动退出；有操作会重新计时。</small></div>",
            stepTitle,
            stepHint);
    Esp32BaseWeb::sendChunk("<div class='calibration-kpi-grid'>");
    sendFmt("<div class='calibration-kpi'><span>本次样本</span><strong class='calibration-kpi-main'>%u / %u</strong><small>2 条可生成；推荐 3 条</small></div>",
            static_cast<unsigned>(snapshot.calibrationValidSampleCount),
            static_cast<unsigned>(kCalibrationMaxValidSamples));
    sendFmt("<div class='calibration-kpi'><span>尝试次数</span><strong class='calibration-kpi-main'>%u / %u</strong><small>最多 6 次</small></div>",
            static_cast<unsigned>(snapshot.calibrationAttemptCount),
            static_cast<unsigned>(kCalibrationMaxAttempts));
    char minText[24]{};
    char maxText[24]{};
    formatLiters(snapshot.calibrationMinActualMl, minText, sizeof(minText));
    formatLiters(snapshot.calibrationMaxActualMl, maxText, sizeof(maxText));
    sendFmt("<div class='calibration-kpi'><span>容量范围</span><strong class='calibration-kpi-main'>%s - %s</strong><small>优先覆盖小/中/大容量</small></div>",
            snapshot.calibrationValidSampleCount > 0 ? minText : "-",
            snapshot.calibrationValidSampleCount > 0 ? maxText : "-");
    Esp32BaseWeb::sendChunk("</div></div><div class='form-actions calibration-primary-actions'>");
    if (!sessionActive) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                                "<input type='hidden' name='action' value='start_session'>");
        sendFmt("<input class='primary' type='submit' value='进入校准模式'%s></form>",
                canStartSession ? "" : " disabled");
    } else {
        Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration' onsubmit=\"return confirm('确认退出并丢弃本次校准会话？')&&once(this)\">"
                                "<input type='hidden' name='action' value='discard_session'>");
        sendFmt("<input class='secondary' type='submit' value='退出校准模式'%s%s></form>",
                canDiscardSession ? "" : " disabled",
                canDiscardSession ? "" : " title='正在出水时不能退出校准模式'");
    }
    Esp32BaseWeb::sendChunk("</div>");
    if (canEnterActual) {
        Esp32BaseWeb::sendChunk("<form class='sample-calibration-form' method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                                "<input type='hidden' name='action' value='save_actual'>"
                                "<label class='compact-field'><span>本次实测容量</span><span class='estimator-input-row'>"
                                "<input name='actualMl' type='number' min='");
        sendFmt("%lu", static_cast<unsigned long>(kCalibrationMinActualMl));
        Esp32BaseWeb::sendChunk("' max='");
        sendFmt("%lu", static_cast<unsigned long>(kMaxVolumePresetMl));
        Esp32BaseWeb::sendChunk("' step='1' required><span class='unit-label'>ml</span></span></label>"
                                "<div class='form-actions'><input class='primary' type='submit' value='保存为有效样本'></form>"
                                "<form method='post' action='/faucet/calibration' onsubmit=\"return confirm('确认放弃本次出水样本？')&&once(this)\">"
                                "<input type='hidden' name='action' value='skip_attempt'>"
                                "<input class='danger' type='submit' value='放弃本次'></form></div>");
    }
    Esp32BaseWeb::sendChunk("<div class='form-actions calibration-secondary-actions'>"
                            "<form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='generate_session'>");
    sendFmt("<input class='secondary' type='submit' value='生成计量方案'%s></form>",
            canGenerate ? "" : " disabled");
    Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration' onsubmit=\"return confirm('确认保存并启用本次生成的计量方案？')&&once(this)\">"
                            "<input type='hidden' name='action' value='apply_session'>");
    sendFmt("<input class='primary' type='submit' value='确认应用'%s></form></div>",
            canApply ? "" : " disabled");
    Esp32BaseWeb::sendChunk("</section>");
    sendCalibrationSamplesPanel(configuredPulseObservationWindowSec());
    sendCalibrationPageScript();
    sendPageEnd();
}

void handleMeteringPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    if (!requireContext()) {
        return;
    }
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        handleMeteringPost();
        return;
    }
    if (waterTaskActive()) {
        sendBusyJson("metering_page");
        return;
    }

    char text[32]{};
    if (getParam("partial", text, sizeof(text))) {
        if (!Esp32BaseWeb::beginResponse(200, "text/html; charset=utf-8", nullptr)) {
            return;
        }
        if (std::strcmp(text, "schemes") == 0) {
            sendCalibrationParameterPanels();
        } else if (std::strcmp(text, "generation") == 0) {
            sendCalibrationGenerationPanel();
        }
        Esp32BaseWeb::endResponse();
        return;
    }
    if (getParam("scheme", text, sizeof(text))) {
        if (std::strcmp(text, "new") == 0) {
            sendMeteringSchemeEditPage(true, nullptr);
            return;
        }
        std::uint32_t id = 0;
        MeteringSchemeRecord scheme{};
        if (!parseU32(text, id) || !ensureMeteringSchemesReady() || !g_context.meteringSchemes->findById(id, scheme)) {
            Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=invalid_value");
            return;
        }
        sendMeteringSchemeEditPage(false, &scheme);
        return;
    }

    Esp32BaseWeb::sendHeader("计量方案");
    Esp32BaseWeb::sendChunk("<h2>计量方案</h2>");
    sendNoticeFromQuery();
    Esp32BaseWeb::sendChunk("<p class='muted'>集中管理当前启用的流量计计量参数、手工方案，以及从样本库生成的新方案；本页不提供远程出水或停水能力。</p>");
    Esp32BaseWeb::sendChunk("<div class='calibration-param-layout'>");
    sendActiveMeteringSchemeSummaryPanel();
    sendMeteringSchemeListPlaceholder();
    Esp32BaseWeb::sendChunk("</div>");
    if (generationResultRequested()) {
        sendCalibrationGenerationPanel();
    } else {
        sendCalibrationGenerationPlaceholder();
    }
    sendCalibrationFormulaPanel();
    sendMeteringTrialModal();
    sendCalibrationPageScript();
    sendPageEnd();
}

void handleRecordDetailPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    if (Esp32BaseWeb::hasParam("info")) {
        handleRecordInfoPage();
        return;
    }
    char text[24]{};
    const bool fromCalibration = calibrationContextRequested();
    const char* backHref = fromCalibration ? "/faucet/calibration" : "/faucet/records";
    const char* backLabel = fromCalibration ? "返回校准" : "返回记录";
    const char* detailPath = fromCalibration ? "/faucet/calibration/detail" : "/faucet/records/detail";
    const char* contextParam = fromCalibration ? "from=calibration&" : "";
    bool rawRequest = false;
    if (getParam("raw", text, sizeof(text))) {
        std::uint32_t rawValue = 0;
        rawRequest = parseU32(text, rawValue) && rawValue != 0;
    }
    bool rawTraceShowAll = false;
    if (getParam("all", text, sizeof(text))) {
        std::uint32_t allValue = 0;
        rawTraceShowAll = parseU32(text, allValue) && allValue != 0;
    }
    if (!contextReady()) {
        if (rawRequest) {
            sendPlainTextResponse(503, "上下文未就绪。\n");
        } else {
            Esp32BaseWeb::sendHeader("脉冲明细");
            Esp32BaseWeb::sendChunk("<h2>脉冲明细</h2><p class='err'>上下文未就绪。</p>");
            sendPageEnd();
        }
        return;
    }
    if (waterTaskActive()) {
        sendBusyJson("record_detail");
        return;
    }
    if (!g_context.pulseTraces && !g_context.savedPulseTraces) {
        if (rawRequest) {
            sendPlainTextResponse(503, "脉冲明细缓存不可用。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>脉冲明细缓存不可用。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }
    std::uint32_t traceId = 0;
    if (!getParam("trace", text, sizeof(text)) || !parseU32(text, traceId)) {
        if (rawRequest) {
            sendPlainTextResponse(400, "明细编号无效。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>明细编号无效。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }
    std::uint32_t bucketSeconds = 1;
    if (getParam("bucket", text, sizeof(text))) {
        parseU32(text, bucketSeconds);
    }
    if (bucketSeconds != 2 && bucketSeconds != 3 && bucketSeconds != 4 && bucketSeconds != 5) {
        bucketSeconds = 1;
    }
    bool savedSource = false;
    if (getParam("saved", text, sizeof(text))) {
        std::uint32_t savedValue = 0;
        savedSource = parseU32(text, savedValue) && savedValue != 0;
    }
    WaterPulseTrace savedTrace{};
    const WaterPulseTrace* trace = nullptr;
    if (savedSource) {
        if (ensureSavedPulseTracesReady() && g_context.savedPulseTraces->findById(traceId, savedTrace)) {
            trace = &savedTrace;
        }
    } else if (g_context.pulseTraces) {
        trace = g_context.pulseTraces->findById(traceId);
    }
    if (!trace) {
        if (rawRequest) {
            sendPlainTextResponse(404, "该脉冲明细不存在或已被 RAM 缓存淘汰。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>该脉冲明细不存在或已被 RAM 缓存淘汰。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }

