tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace->sampleCount]{};
    if (!samples) {
        delete[] samples;
        if (rawRequest) {
            sendPlainTextResponse(500, "内存不足，无法生成脉冲明细。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    if (savedSource) {
        if (!g_context.savedPulseTraces ||
            g_context.savedPulseTraces->readSamples(trace->traceId, samples, trace->sampleCount) != trace->sampleCount) {
            delete[] samples;
            if (rawRequest) {
                sendPlainTextResponse(500, "设备明细读取失败。\n");
                return;
            }
            Esp32BaseWeb::sendHeader("脉冲明细");
            Esp32BaseWeb::sendChunk("<p class='err'>设备明细读取失败。</p>");
            sendPageEnd();
            return;
        }
    } else {
        for (std::size_t i = 0; i < trace->sampleCount; ++i) {
            const WaterPulseTraceSample* sample = g_context.pulseTraces ? g_context.pulseTraces->sampleAt(*trace, i) : nullptr;
            samples[i] = sample ? *sample : WaterPulseTraceSample{};
        }
    }
    if (rawRequest) {
        sendPulseTraceRawText(*trace, samples, rawTraceShowAll);
        delete[] samples;
        return;
    }
    WaterPulseTraceBucket* buckets = new (std::nothrow) WaterPulseTraceBucket[trace->sampleCount]{};
    if (!buckets) {
        delete[] samples;
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    const std::size_t bucketCount =
        aggregateWaterPulseTrace(*trace, samples, trace->sampleCount, bucketSeconds, buckets, trace->sampleCount);
    const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(*trace, samples, trace->sampleCount);
    std::uint32_t maxDelta = 1;
    std::uint32_t maxRawDelta = 1;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        maxDelta = std::max(maxDelta, buckets[i].pulseDelta);
        maxRawDelta = std::max(maxRawDelta, buckets[i].rawEdgeDelta);
    }
    const std::uint32_t rawEdgeCount = static_cast<std::uint32_t>(trace->sampleCount);
    const std::uint32_t effectivePulseCountValue = effectivePulseCount(*trace, samples, trace->sampleCount);
    const std::uint32_t filteredEdgeCount =
        rawEdgeCount >= effectivePulseCountValue ? rawEdgeCount - effectivePulseCountValue : 0;
    const std::uint32_t effectiveRateTenths =
        rawEdgeCount == 0 ? 0 : static_cast<std::uint32_t>((effectivePulseCountValue * 1000ULL + rawEdgeCount / 2U) / rawEdgeCount);
    std::uint32_t pauseTotalUs = 0;
    for (std::uint8_t i = 0; i < trace->pauseWindowCount; ++i) {
        const WaterPulseTracePauseWindow& window = trace->pauseWindows[i];
        if (window.endElapsedUs > window.startElapsedUs) {
            pauseTotalUs += window.endElapsedUs - window.startElapsedUs;
        }
    }
    MeteringParameters trendMeteringParams{};
    const bool trendVolumeReady = meteringParamsForRecordTrend(trace->record, trendMeteringParams);
    const std::uint32_t estimatedFinalVolumeMl =
        trendVolumeReady ? estimateVolumeMlFromPulses(effectivePulseCountValue, trendMeteringParams) : 0;
    const std::uint32_t maxVolumeMl =
        trendVolumeReady ? std::max<std::uint32_t>(1, std::max(trace->record.volumeMl, estimatedFinalVolumeMl)) : 1;

    char startTime[40]{};
    formatWaterRecordTime(trace->record, startTime, sizeof(startTime));
    const std::size_t traceBytes = sizeof(WaterPulseTrace) + trace->sampleCount * sizeof(WaterPulseTraceSample);
    char traceKb[24]{};
    formatKb(traceBytes, traceKb, sizeof(traceKb));
    const bool savedStoreReady = ensureSavedPulseTracesReady();
    WaterPulseTrace savedTraceForRecord{};
    const bool alreadySaved =
        savedStoreReady && g_context.savedPulseTraces->findByRecord(trace->record, savedTraceForRecord);
    const std::uint32_t traceActualMl = actualMlForSegmentedSample(*trace);
    const bool traceActualSynced = trace->actualMl > 0;
    const bool traceActualFromRecord = !traceActualSynced && traceActualMl > 0;
    const std::uint32_t detailVolumeMl = traceActualMl > 0 ? traceActualMl : trace->record.volumeMl;
    char averageFlowText[24]{};
    formatFlowLitersPerMin(recordFlowMlPerMin(detailVolumeMl, trace->record.durationSec),
                           averageFlowText,
                           sizeof(averageFlowText));
    Esp32BaseWeb::sendHeader("脉冲明细");
    sendFmt("<h2>脉冲明细</h2><div class='form-actions'><a class='btn-link' href='%s'>%s</a>",
            backHref,
            backLabel);
    if (savedSource || alreadySaved) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/faucet/records' onsubmit=\"return confirm('确认删除这条设备明细？')&&once(this)\">"
                                "<input type='hidden' name='action' value='delete'>");
        if (fromCalibration) {
            Esp32BaseWeb::sendChunk("<input type='hidden' name='returnTo' value='calibration'>");
        }
        sendFmt("<input type='hidden' name='trace' value='%lu'><input class='secondary' type='submit' value='删除设备明细'></form>",
                static_cast<unsigned long>(savedSource ? trace->traceId : savedTraceForRecord.traceId));
    } else if (savedStoreReady) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/faucet/records' onsubmit=\"return once(this)\">"
                                "<input type='hidden' name='action' value='save'>");
        if (fromCalibration) {
            Esp32BaseWeb::sendChunk("<input type='hidden' name='returnTo' value='calibration'>");
        }
        sendFmt("<input type='hidden' name='trace' value='%lu'><input class='secondary' type='submit' value='保存设备明细'></form>",
                static_cast<unsigned long>(trace->traceId));
    } else {
        Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>样本库不可用</span>");
    }
    Esp32BaseWeb::sendChunk("</div>");

