tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool persistConfig(const SystemConfig& config) {
    if (!g_context.app->canApplyConfig()) {
        return false;
    }

    SystemConfig safe = g_context.configStore->loadSystemConfig();
    if (g_context.configStore->systemConfigReadOnly()) {
        return false;
    }
    mergeChangedConfigFields(*g_context.config, config, safe);
    sanitizeConfig(safe);
    if (!g_context.configStore->saveSystemConfig(safe)) {
        return false;
    }
    if (!g_context.app->applyConfig(safe)) {
        return false;
    }
    *g_context.config = safe;
    if (g_context.applySettings) {
        g_context.applySettings(*g_context.config);
    }
    return true;
}

bool saveConfigAndReply(const SystemConfig& config) {
    if (!g_context.app->canApplyConfig()) {
        Esp32BaseWeb::sendJson(409, "{\"error\":\"busy\",\"restartRecommended\":true}");
        return false;
    }
    const bool ok = persistConfig(config);
    Esp32BaseWeb::sendJson(ok ? 200 : 500,
                           ok ? "{\"ok\":true,\"restartRecommended\":true}" : "{\"error\":\"save_failed\"}");
    return ok;
}

void handleCalibrationPost() {
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (!Esp32BaseWeb::checkPostAllowed("faucet_calibration")) {
        return;
    }
    char text[32]{};
    if (!getParam("action", text, sizeof(text))) {
        redirectCalibrationFailure("invalid_action");
        return;
    }
    if (std::strcmp(text, "start_session") == 0) {
        if (waterTaskActive()) {
            redirectCalibrationFailure("busy");
            return;
        }
        if (!calibrationSessionStorageReady()) {
            redirectCalibrationFailure("calibration_storage_unavailable");
            return;
        }
        redirectCalibrationResult(g_context.app && g_context.app->startCalibrationSessionForWeb(
                                                   g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                  "session_started",
                                  "invalid_state");
        return;
    }
    if (std::strcmp(text, "discard_session") == 0) {
        redirectCalibrationResult(g_context.app && g_context.app->discardCalibrationSessionForWeb(
                                                   g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                  "session_discarded",
                                  "invalid_state");
        return;
    }
    if (std::strcmp(text, "save_actual") == 0) {
        std::uint32_t actualMl = 0;
        if (!getParam("actualMl", text, sizeof(text)) || !parseU32(text, actualMl) ||
            actualMl < kCalibrationMinActualMl || actualMl > kMaxVolumePresetMl) {
            redirectCalibrationFailure("invalid_value");
            return;
        }
        redirectCalibrationResult(g_context.app && g_context.app->submitCalibrationActualForWeb(
                                                   actualMl, g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                  "actual",
                                  "save_failed");
        return;
    }
    if (std::strcmp(text, "skip_attempt") == 0) {
        redirectCalibrationResult(g_context.app && g_context.app->skipCalibrationAttemptForWeb(
                                                   CalibrationSkipReason::Mistake,
                                                   g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                  "attempt_skipped",
                                  "invalid_state");
        return;
    }
    if (std::strcmp(text, "save_long_term_sample") == 0) {
        std::uint32_t attemptIndex = 0;
        if (!getParam("attemptIndex", text, sizeof(text)) || !parseU32(text, attemptIndex) ||
            attemptIndex >= kCalibrationMaxAttempts) {
            redirectCalibrationFailure("invalid_value");
            return;
        }
        std::uint32_t sampleId = 0;
        redirectCalibrationResult(
            g_context.app &&
                g_context.app->saveCalibrationSessionSampleToLongTermForWeb(
                    static_cast<std::uint8_t>(attemptIndex),
                    g_context.nowSeconds ? g_context.nowSeconds() : 0,
                    sampleId),
            "long_term_sample",
            "save_failed");
        return;
    }
    if (std::strcmp(text, "generate_session") == 0) {
        redirectCalibrationResult(g_context.app && g_context.app->generateCalibrationForWeb(
                                                   g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                  "generated",
                                  "sample_not_enough");
        return;
    }
    if (std::strcmp(text, "apply_session") == 0) {
        redirectCalibrationResult(g_context.app && g_context.app->applyGeneratedCalibrationForWeb(
                                                   g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                  "applied",
                                  "no_generated_result");
        return;
    }
    if (std::strcmp(text, "calibrate") == 0) {
        handleRecordCalibrationApi();
        return;
    }
    if (std::strcmp(text, "generate_segmented") == 0) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=invalid_action");
        return;
    }
    if (std::strcmp(text, "save_generated_scheme") == 0) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=invalid_action");
        return;
    }
    redirectCalibrationFailure("invalid_action");
}

void handleMeteringPost() {
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (!Esp32BaseWeb::checkPostAllowed("faucet_metering")) {
        return;
    }
    char text[32]{};
    if (!getParam("action", text, sizeof(text))) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=invalid_value");
        return;
    }
    if (std::strcmp(text, "generate_segmented") == 0) {
        handleGenerateSegmentedCalibrationApi();
        return;
    }
    if (std::strcmp(text, "save_generated_scheme") == 0) {
        handleSaveGeneratedSchemeApi();
        return;
    }
    if (std::strcmp(text, "discard_generated_scheme") == 0) {
        handleDiscardGeneratedSchemeApi();
        return;
    }
    if (std::strcmp(text, "create_metering_scheme") == 0) {
        handleCreateMeteringSchemeApi();
        return;
    }
    if (std::strcmp(text, "edit_metering_scheme") == 0) {
        handleEditMeteringSchemeApi();
        return;
    }
    if (std::strcmp(text, "enable_metering_scheme") == 0) {
        handleEnableMeteringSchemeApi();
        return;
    }
    if (std::strcmp(text, "delete_metering_scheme") == 0) {
        handleDeleteMeteringSchemeApi();
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=invalid_value");
}

bool persistFilterConfig(const FilterRecord& record, std::size_t index) {
    if (!g_context.app->canApplyConfig() || index >= kFilterCount) {
        return false;
    }

