tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    const std::uint16_t sanitizedPageSize = sanitizeRecordPageSize(static_cast<std::uint16_t>(pageSize));
    WaterRecord* records = new (std::nothrow) WaterRecord[kMaxRecordPageSize]{};
    char* json = new (std::nothrow) char[32768]{};
    if (!records || !json) {
        delete[] records;
        delete[] json;
        Esp32BaseWeb::sendJson(500, "{\"error\":\"oom\"}");
        return;
    }
    const WaterRecordFileStatus recordStatus = g_context.records->status();
    const bool ready = g_context.records->ready();
    std::size_t totalCount = 0;
    const std::size_t readCount =
        ready ? queryWaterRecords(*g_context.records, filter, page, sanitizedPageSize, records, kMaxRecordPageSize, &totalCount) : 0;
    sendJsonBuffer(writeWaterRecordsJson(records,
                                      readCount,
                                      page,
                                      sanitizedPageSize,
                                      totalCount,
                                      g_context.records->storageName(),
                                      waterRecordFileStatusCode(recordStatus),
                                      json,
                                      32768),
                   json);
    delete[] records;
    delete[] json;
}

void handleStatsApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::sendJson(409, "{\"error\":\"busy\"}");
        return;
    }
    char* json = new (std::nothrow) char[8192]{};
    if (!json) {
        Esp32BaseWeb::sendJson(500, "{\"error\":\"oom\"}");
        return;
    }
    const WaterUsageSummary summary = aggregateWaterRecords(*g_context.records, g_context.nowSeconds(), kChartDays);
    const std::uint32_t totalMl = g_context.app->snapshot().statistics.totalMl;
    sendJsonBuffer(writeUsageSummaryJson(summary, totalMl, json, 8192), json);
    delete[] json;
}

void handleRecordCalibrationApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    const bool ajax = Esp32BaseWeb::hasParam("ajax");
    auto fail = [ajax](int status, const char* json, const char* redirectUrl) {
        if (ajax) {
            Esp32BaseWeb::sendJson(status, json);
        } else {
            Esp32BaseWeb::redirectSeeOther(redirectUrl);
        }
    };
    auto ok = [ajax]() {
        if (ajax) {
            Esp32BaseWeb::sendJson(200, "{\"ok\":true}");
        } else {
            Esp32BaseWeb::redirectSeeOther("/faucet/calibration?saved=actual");
        }
    };
    if (waterTaskActive()) {
        fail(409, "{\"error\":\"busy\"}", "/faucet/calibration?error=busy");
        return;
    }

    WaterPulseTrace trace{};
    bool savedSource = false;
    std::uint32_t traceId = 0;
    if (!readCalibrationTraceFromRequest(trace, savedSource, traceId)) {
        fail(404, "{\"error\":\"no_calibration_record\"}", "/faucet/calibration?error=no_calibration_record");
        return;
    }

    char text[32]{};
    std::uint32_t actualMl = 0;
    if (!getParam("actualMl", text, sizeof(text)) || !parseU32(text, actualMl)) {
        fail(400, "{\"error\":\"invalid_value\"}", "/faucet/calibration?error=invalid_value");
        return;
    }
    if (actualMl < kMinVolumePresetMl || actualMl > kMaxVolumePresetMl) {
        fail(400, "{\"error\":\"invalid_value\"}", "/faucet/calibration?error=invalid_value");
        return;
    }
    WaterRecord record = trace.record;
    WaterRecordCalibration calibration{};
    const bool calibrated = findRecordCalibration(record, calibration);
    const std::uint32_t defaultActualMl = calibrated ? calibration.actualMl : trace.record.volumeMl;
    (void)defaultActualMl;

    if (!ensureCalibratedTraceSaved(savedSource, traceId, trace.record, actualMl)) {
        fail(500, "{\"error\":\"save_failed\"}", "/faucet/calibration?error=save_failed");
        return;
    }
    if (!saveRecordActualMeasurement(record, actualMl)) {
        fail(500, "{\"error\":\"calibration_mark_failed\"}", "/faucet/calibration?error=calibration_mark_failed");
        return;
    }
    syncTraceActualMeasurement(record, actualMl);
    ok();
}

void handleGenerateSegmentedCalibrationApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    const bool ajax = Esp32BaseWeb::hasParam("ajax");
    auto fail = [ajax](int status, const char* json, const char* redirectUrl) {
        if (ajax) {
            Esp32BaseWeb::sendJson(status, json);
        } else {
            Esp32BaseWeb::redirectSeeOther(redirectUrl);
        }
    };
    auto ok = [ajax]() {
        if (ajax) {
            Esp32BaseWeb::sendJson(200, "{\"ok\":true}");
        } else {
            Esp32BaseWeb::redirectSeeOther("/faucet/metering?saved=generated");
        }
    };
    if (waterTaskActive()) {
        fail(409, "{\"error\":\"busy\"}", "/faucet/metering?error=busy");
        return;
    }
    if (!generateSegmentedCalibrationResultFromSavedSamples()) {
        fail(400, "{\"error\":\"sample_not_enough\"}", "/faucet/metering?error=sample_not_enough");
        return;
    }
    ok();
}

void handleSaveGeneratedSchemeApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?generated=1&error=busy");
        return;
    }
    if (!ensureMeteringSchemesReady()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?generated=1&error=metering_storage_unavailable");
        return;
    }
    const SegmentedSampleDiagnostics diagnostics = collectSegmentedSampleDiagnostics(false);
    MeteringSchemeCandidate candidate{};
    if (!makeSegmentedCandidate(diagnostics.result, candidate)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=no_generated_result");
        return;
    }
    char name[kMeteringSchemeNameLength]{};
    Esp32BaseWeb::getParam("name", name, sizeof(name));
    if (name[0] == '\0') {
        std::snprintf(name, sizeof(name), "样本生成方案");
    }
    std::uint32_t newId = 0;
    if (!g_context.meteringSchemes->saveCandidateAsNew(
            candidate, name, g_context.nowSeconds ? g_context.nowSeconds() : 0, newId)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?generated=1&error=save_failed");
        return;
    }
    char url[80]{};
    std::snprintf(url,
                  sizeof(url),
                  "/faucet/metering?saved=scheme_created&createdScheme=%lu",
                  static_cast<unsigned long>(newId));
    Esp32BaseWeb::redirectSeeOther(url);
}

void handleDiscardGeneratedSchemeApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    const bool ajax = Esp32BaseWeb::hasParam("ajax");
    auto fail = [ajax](int status, const char* json, const char* redirectUrl) {
        if (ajax) {
            Esp32BaseWeb::sendJson(status, json);
        } else {
            Esp32BaseWeb::redirectSeeOther(redirectUrl);
        }
    };
    auto ok = [ajax]() {
        if (ajax) {
            Esp32BaseWeb::sendJson(200, "{\"ok\":true}");
        } else {
            Esp32BaseWeb::redirectSeeOther("/faucet/metering?saved=generated_discarded");
        }
    };
    if (waterTaskActive()) {
        fail(409, "{\"error\":\"busy\"}", "/faucet/metering?error=busy");
        return;
    }
    ok();
}

