tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool readMeteringParamsFromRequest(MeteringParameters& params) {
    char text[32]{};
    float startupDurationSec = 0.0f;
    if (!(getParam("startupPulseCount", text, sizeof(text)) && parseU32(text, params.startupPulseCount) &&
          getParam("startupVolumeMl", text, sizeof(text)) && parseU32(text, params.startupVolumeMl) &&
          getParam("stablePulsePerLiter", text, sizeof(text)) && parseU32(text, params.stablePulsePerLiter) &&
          getParam("startupDurationSec", text, sizeof(text)) && parseFloat(text, startupDurationSec) &&
          getParam("stableFlowMlPerMin", text, sizeof(text)) && parseU32(text, params.stableFlowMlPerMin))) {
        return false;
    }
    if (startupDurationSec < 0.0f ||
        startupDurationSec > static_cast<float>(kMaxSegmentedStartupDurationMs) / 1000.0f) {
        return false;
    }
    params.startupDurationMs = static_cast<std::uint32_t>(startupDurationSec * 1000.0f + 0.5f);
    return validMeteringSchemeParameters(params);
}

bool readMeteringSchemeId(std::uint32_t& id) {
    char text[32]{};
    return getParam("id", text, sizeof(text)) && parseU32(text, id) && id > 0;
}

void handleCreateMeteringSchemeApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=busy");
        return;
    }
    if (!ensureMeteringSchemesReady()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=metering_storage_unavailable");
        return;
    }
    MeteringParameters params{};
    if (!readMeteringParamsFromRequest(params)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=invalid_value");
        return;
    }
    char name[kMeteringSchemeNameLength]{};
    if (!getParam("name", name, sizeof(name)) || name[0] == '\0') {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=invalid_value");
        return;
    }
    std::uint32_t newId = 0;
    if (!g_context.meteringSchemes->createManual(name, params, g_context.nowSeconds ? g_context.nowSeconds() : 0, newId)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=save_failed");
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/metering?saved=scheme_created");
}

void handleEditMeteringSchemeApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=busy");
        return;
    }
    if (!ensureMeteringSchemesReady()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=metering_storage_unavailable");
        return;
    }
    std::uint32_t id = 0;
    MeteringParameters params{};
    if (!readMeteringSchemeId(id) || !readMeteringParamsFromRequest(params)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=invalid_value");
        return;
    }
    MeteringSchemeRecord current{};
    if (!g_context.meteringSchemes->findById(id, current)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=invalid_value");
        return;
    }
    MeteringSchemeRecord edited = current;
    Esp32BaseWeb::getParam("name", edited.name, sizeof(edited.name));
    edited.params = params;
    const MeteringSchemeEdit edit = makeMeteringSchemeEdit(edited);
    if (current.usedEver && classifyMeteringSchemeEdit(current, edit) == MeteringSchemeEditKind::MeteringOrApplicability) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=used_scheme_locked");
        return;
    }
    if (!g_context.meteringSchemes->updateScheme(edited, g_context.nowSeconds ? g_context.nowSeconds() : 0)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=save_failed");
        return;
    }
    if (id == g_context.meteringSchemes->activeSchemeId()) {
        MeteringSchemeRecord active{};
        if (g_context.meteringSchemes->activeScheme(active) && g_context.app) {
            g_context.app->applyActiveMeteringScheme(active);
        }
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/metering?saved=scheme");
}

void handleEnableMeteringSchemeApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive() || !g_context.app || !g_context.app->canApplyConfig()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=busy");
        return;
    }
    if (!ensureMeteringSchemesReady()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=metering_storage_unavailable");
        return;
    }
    std::uint32_t id = 0;
    if (!readMeteringSchemeId(id)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=invalid_value");
        return;
    }
    if (!g_context.meteringSchemes->enableScheme(id, g_context.nowSeconds ? g_context.nowSeconds() : 0)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=save_failed");
        return;
    }
    MeteringSchemeRecord active{};
    if (!g_context.meteringSchemes->activeScheme(active) || !g_context.app->applyActiveMeteringScheme(active)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=save_failed");
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/metering?saved=scheme_enabled");
}

void handleDeleteMeteringSchemeApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=busy");
        return;
    }
    if (!ensureMeteringSchemesReady()) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=metering_storage_unavailable");
        return;
    }
    std::uint32_t id = 0;
    if (!readMeteringSchemeId(id) || !g_context.meteringSchemes->deleteScheme(id)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/metering?error=invalid_value");
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/metering?saved=scheme_deleted");
}

void handleTraceCalibrationApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    char text[32]{};
    std::uint32_t traceId = 0;
    if (getParam("action", text, sizeof(text))) {
        if (std::strcmp(text, "delete") == 0) {
            handleTraceDeleteApi();
            return;
        }
    }
    if (!g_context.pulseTraces) {
        Esp32BaseWeb::redirectSeeOther("/faucet/records?error=no_calibration_record");
        return;
    }
    std::uint32_t actualMl = 0;
    if (!getParam("trace", text, sizeof(text)) || !parseU32(text, traceId) ||
        !getParam("actualMl", text, sizeof(text)) || !parseU32(text, actualMl) ||
        actualMl < kMinVolumePresetMl || actualMl > kMaxVolumePresetMl) {
        Esp32BaseWeb::redirectSeeOther("/faucet/records?error=invalid_value");
        return;
    }
    if (!g_context.pulseTraces->setActualMl(traceId, actualMl)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/records?error=no_calibration_record");
        return;
    }

    char url[96]{};
    std::snprintf(url, sizeof(url), "/faucet/records/detail?trace=%lu&bucket=1&saved=calibrated",
                  static_cast<unsigned long>(traceId));
    Esp32BaseWeb::redirectSeeOther(url);
}

